var counter =1;
                function next(){
					"use strict";
					counter++;
                    if(counter == 2){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img2.jpg");
                        //txt
				   document.getElementById("txt").innerHTML='<mark>{6} إِنَّ الَّذِينَ كَفَرُوا سَوَاءٌ عَلَيْهِمْ أَأَنْذَرْتَهُمْ أَمْ لَمْ تُنْذِرْهُمْ لَا يُؤْمِنُونَ</mark><br>"إنّ الَّذِينَ كَفَرُوا" كَأَبِي جَهْل وَأَبِي لَهَب وَنَحْوهمَا "سَوَاء عَلَيْهِمْ أَأَنْذَرْتهمْ" بِتَحْقِيقِ الْهَمْزَتَيْنِ وَإِبْدَال الثَّانِيَة أَلِفًا وَتَسْهِيلهَا وَإِدْخَال أَلِف بَيْن الْمُسَهَّلَة وَالْأُخْرَى وَتَرْكه "أَمْ لَمْ تُنْذِرهُمْ لَا يُؤْمِنُونَ" لِعِلْمِ اللَّه مِنْهُمْ ذَلِك فَلَا تَطْمَع فِي إيمَانهمْ وَالْإِنْذَار إعْلَام مَعَ تَخْوِيف .<br><br><mark>{7} خَتَمَ اللَّهُ عَلَى قُلُوبِهِمْ وَعَلَى سَمْعِهِمْ وَعَلَى أَبْصَارِهِمْ غِشَاوَةٌ وَلَهُمْ عَذَابٌ عَظِيمٌ</mark><br>"خَتَمَ اللَّه عَلَى قُلُوبهمْ" طَبَعَ عَلَيْهَا وَاسْتَوْثَقَ فَلَا يَدْخُلهَا خَيْر "وَعَلَى سَمْعهمْ" أَيْ مَوَاضِعه فَلَا يَنْتَفِعُونَ بِمَا يَسْمَعُونَهُ مِنْ الْحَقّ "وَعَلَى أَبْصَارهمْ غِشَاوَة" غِطَاء فَلَا يُبْصِرُونَ الْحَقّ "وَلَهُمْ عَذَاب عَظِيم" قَوِيّ دَائِم<br><br><mark>{8} وَمِنَ النَّاسِ مَنْ يَقُولُ آمَنَّا بِاللَّهِ وَبِالْيَوْمِ الْآخِرِ وَمَا هُمْ بِمُؤْمِنِينَ</mark><br>"وَمِنْ النَّاس مَنْ يَقُول آمَنَّا بِاَللَّهِ وَبِالْيَوْمِ الْآخِر" وَنَزَلَ فِي الْمُنَافِقِينَ أَيْ يَوْم الْقِيَامَة لِأَنَّهُ آخِر الْأَيَّام "وَمَا هُمْ بِمُؤْمِنِينَ" رُوعِيَ فِيهِ مَعْنَى مِنْ وَفِي ضَمِير يَقُول لَفْظهَا<br><br><mark>{9} يُخَادِعُونَ اللَّهَ وَالَّذِينَ آمَنُوا وَمَا يَخْدَعُونَ إِلَّا أَنْفُسَهُمْ وَمَا يَشْعُرُونَ</mark><br>"يُخَادِعُونَ اللَّه وَاَلَّذِينَ آمَنُوا" بِإِظْهَارِ خِلَاف مَا أَبْطَنُوهُ مِنْ الْكُفْر لِيَدْفَعُوا عَنْهُمْ أَحْكَامه الدُّنْيَوِيَّة "وَمَا يَخْدَعُونَ إلَّا أَنَفْسهمْ" لِأَنَّ وَبَال خِدَاعهمْ رَاجِع إلَيْهِمْ فَيُفْتَضَحُونَ فِي الدُّنْيَا بِإِطْلَاعِ اللَّه نَبِيّه عَلَى مَا أَبْطَنُوهُ وَيُعَاقَبُونَ فِي الْآخِرَة "وَمَا يَشْعُرُونَ" يَعْلَمُونَ أَنَّ خِدَاعهمْ لِأَنْفُسِهِمْ وَالْمُخَادَعَة هُنَا مِنْ وَاحِد كَعَاقَبْت اللِّصّ وَذِكْر اللَّه فِيهَا تَحْسِين وَفِي قِرَاءَة وَمَا يَخْدَعُونَ<br><br><mark>{10} فِي قُلُوبِهِمْ مَرَضٌ فَزَادَهُمُ اللَّهُ مَرَضًا وَلَهُمْ عَذَابٌ أَلِيمٌ بِمَا كَانُوا يَكْذِبُونَ</mark><br>"فِي قُلُوبهمْ مَرَض" شَكّ وَنِفَاق فَهُوَ يُمْرِض قُلُوبهمْ أَيْ يُضْعِفهَا "فَزَادَهُمْ اللَّه مَرَضًا" بِمَا أَنْزَلَهُ مِنْ الْقُرْآن لِكُفْرِهِمْ بِهِ "وَلَهُمْ عَذَاب أَلِيم" مُؤْلِم "بِمَا كَانُوا يُكَذِّبُونَ" بِالتَّشْدِيدِ أَيْ : نَبِيّ اللَّه وَبِالتَّخْفِيفِ أَيْ قَوْلهمْ آمَنَّا<br><br><mark>{11} وَإِذَا قِيلَ لَهُمْ لَا تُفْسِدُوا فِي الْأَرْضِ قَالُوا إِنَّمَا نَحْنُ مُصْلِحُونَ</mark><br>"وَإِذَا قِيلَ لَهُمْ" أَيْ لِهَؤُلَاءِ "لَا تُفْسِدُوا فِي الْأَرْض" بِالْكُفْرِ وَالتَّعْوِيق عَنْ الْإِيمَان "قَالُوا إنَّمَا نَحْنُ مُصْلِحُونَ" وَلَيْسَ مَا نَحْنُ فِيهِ بِفَسَادٍ قَالَ اللَّه تَعَالَى رَدًّا عَلَيْهِمْ :<br><br><mark>{12} أَلَا إِنَّهُمْ هُمُ الْمُفْسِدُونَ وَلَكِنْ لَا يَشْعُرُونَ</mark><br>"أَلَا" لِلتَّنْبِيهِ "إنَّهُمْ هُمْ الْمُفْسِدُونَ وَلَكِنْ لَا يَشْعُرُونَ" بِذَلِكَ .<br><br><mark>{13} وَإِذَا قِيلَ لَهُمْ آمِنُوا كَمَا آمَنَ النَّاسُ قَالُوا أَنُؤْمِنُ كَمَا آمَنَ السُّفَهَاءُ أَلَا إِنَّهُمْ هُمُ السُّفَهَاءُ وَلَكِنْ لَا يَعْلَمُونَ</mark><br>"وَإِذَا قِيلَ لَهُمْ آمِنُوا كَمَا آمَنَ النَّاس" أَصْحَاب النَّبِيّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ "قَالُوا أَنُؤْمِنُ كَمَا آمَنَ السُّفَهَاء" الْجُهَّال أَيْ لَا نَفْعَل كَفِعْلِهِمْ قَالَ تَعَالَى رَدًّا عَلَيْهِمْ : "أَلَا إنَّهُمْ هُمْ السُّفَهَاء وَلَكِنْ لَا يَعْلَمُونَ" ذَلِك<br><br><mark>{14} وَإِذَا لَقُوا الَّذِينَ آمَنُوا قَالُوا آمَنَّا وَإِذَا خَلَوْا إِلَى شَيَاطِينِهِمْ قَالُوا إِنَّا مَعَكُمْ إِنَّمَا نَحْنُ مُسْتَهْزِئُونَ</mark><br>"وَإِذَا لَقُوا" أَصْله لَقْيُوا حُذِفَتْ الضَّمَّة لِلِاسْتِثْقَالِ ثُمَّ الْيَاء لِالْتِقَائِهَا سَاكِنَة مَعَ الْوَاو "الَّذِينَ آمَنُوا قَالُوا آمَنَّا وَإِذَا خَلَوْا" مِنْهُمْ وَرَجَعُوا "إلَى شَيَاطِينهمْ" رُؤَسَائِهِمْ "قَالُوا إنَّا مَعَكُمْ" فِي الدِّين "إنَّمَا نَحْنُ مُسْتَهْزِئُونَ" بِهِمْ بِإِظْهَارِ الْإِيمَان<br><br><mark>{15} اللَّهُ يَسْتَهْزِئُ بِهِمْ وَيَمُدُّهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ</mark><br>"اللَّه يَسْتَهْزِئ بِهِمْ" يُجَازِيهِمْ بِاسْتِهْزَائِهِمْ "وَيَمُدّهُمْ" يُمْهِلهُمْ "فِي طُغْيَانهمْ" بِتَجَاوُزِهِمْ الْحَدّ فِي الْكُفْر "يَعْمَهُونَ" يَتَرَدَّدُونَ تَحَيُّرًا حَال<br><br><mark>{16} أُولَئِكَ الَّذِينَ اشْتَرَوُا الضَّلَالَةَ بِالْهُدَى فَمَا رَبِحَتْ تِجَارَتُهُمْ وَمَا كَانُوا مُهْتَدِينَ</mark><br>"أُولَئِكَ الَّذِينَ اشْتَرَوْا الضَّلَالَة بِالْهُدَى" أَيْ اسْتَبْدَلُوهَا بِهِ "فَمَا رَبِحَتْ تِجَارَتهمْ" أَيْ مَا رَبِحُوا فِيهَا بَلْ خَسِرُوا لِمَصِيرِهِمْ إلَى النَّار الْمُؤَبَّدَة عَلَيْهِمْ "وَمَا كَانُوا مُهْتَدِينَ" فِيمَا فَعَلُوا<br><br>';                 }
				   else if(counter == 3){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img3.jpg");
                       //txt
				   document.getElementById("txt").innerHTML='<mark>{17} مَثَلُهُمْ كَمَثَلِ الَّذِي اسْتَوْقَدَ نَارًا فَلَمَّا أَضَاءَتْ مَا حَوْلَهُ ذَهَبَ اللَّهُ بِنُورِهِمْ وَتَرَكَهُمْ فِي ظُلُمَاتٍ لَا يُبْصِرُونَ</mark><br>"مَثَلهمْ" صِفَتهمْ فِي نِفَاقهمْ "كَمَثَلِ الَّذِي اسْتَوْقَدَ" أَوْقَدَ "نَارًا" فِي ظُلْمَة "فَلَمَّا أَضَاءَتْ" أَنَارَتْ "مَا حَوْله" فَأَبْصَرَ وَاسْتَدْفَأَ وَأَمِنَ مِمَّنْ يَخَافهُ "ذَهَبَ اللَّه بِنُورِهِمْ" أَطْفَأَهُ وَجُمِعَ الضَّمِير مُرَاعَاة لِمَعْنَى الَّذِي "وَتَرَكَهُمْ فِي ظُلُمَات لَا يُبْصِرُونَ" مَا حَوْلهمْ مُتَحَيِّرِينَ عَنْ الطَّرِيق خَائِفِينَ فَكَذَلِكَ هَؤُلَاءِ أَمِنُوا بِإِظْهَارِ كَلِمَة الْإِيمَان فَإِذَا مَاتُوا جَاءَهُمْ الْخَوْف وَالْعَذَاب<br><br><mark>{18} صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَرْجِعُونَ</mark><br>هُمْ "صُمّ" عَنْ الْحَقّ فَلَا يَسْمَعُونَهُ سَمَاع قَبُول "بُكْم" خُرْس عَنْ الْخَيْر فَلَا يَقُولُونَهُ "عُمْي" عَنْ طَرِيق الْهُدَى فَلَا يَرَوْنَهُ "فَهُمْ لَا يَرْجِعُونَ" عَنْ الضَّلَالَة<br><br><mark>{19} أَوْ كَصَيِّبٍ مِنَ السَّمَاءِ فِيهِ ظُلُمَاتٌ وَرَعْدٌ وَبَرْقٌ يَجْعَلُونَ أَصَابِعَهُمْ فِي آذَانِهِمْ مِنَ الصَّوَاعِقِ حَذَرَ الْمَوْتِ وَاللَّهُ مُحِيطٌ بِالْكَافِرِينَ</mark><br>"أَوْ" مَثَلهمْ "كَصَيِّبٍ" أَيْ كَأَصْحَابِ مَطَر وَأَصْله صَيْوِب مِنْ صَابَ يَصُوب أَيْ يَنْزِل "مِنْ السَّمَاء" السَّحَاب "فِيهِ" أَيْ السَّحَاب "ظُلُمَات" مُتَكَاثِفَة "وَرَعْد" هُوَ الْمَلَك الْمُوَكَّل بِهِ وَقِيلَ صَوْته "وَبَرْق" لَمَعَان صَوْته الَّذِي يَزْجُرهُ بِهِ "يَجْعَلُونَ" أَيْ أَصْحَاب الصَّيِّب "أَصَابِعهمْ" أَيْ أَنَامِلهَا "فِي آذَانهمْ مِنْ" أَجْل "الصَّوَاعِق" شِدَّة صَوْت الرَّعْد لِئَلَّا يَسْمَعُوهَا "حَذَر" خَوْف "الْمَوْت" مِنْ سَمَاعهَا . كَذَلِكَ هَؤُلَاءِ : إذَا نَزَلَ الْقُرْآن وَفِيهِ ذِكْر الْكُفْر الْمُشَبَّه بِالظُّلُمَاتِ وَالْوَعِيد عَلَيْهِ الْمُشَبَّه بِالرَّعْدِ وَالْحُجَج الْبَيِّنَة الْمُشَبَّهَة بِالْبَرْقِ يَسُدُّونَ آذَانهمْ لِئَلَّا يَسْمَعُوهُ فَيَمِيلُوا إلَى الْإِيمَان وَتَرْك دِينهمْ وَهُوَ عِنْدهمْ مَوْت "وَاَللَّه مُحِيط بِالْكَافِرِينَ" عِلْمًا وَقُدْرَة فَلَا يَفُوتُونَهُ<br><br><mark>{20} يَكَادُ الْبَرْقُ يَخْطَفُ أَبْصَارَهُمْ كُلَّمَا أَضَاءَ لَهُمْ مَشَوْا فِيهِ وَإِذَا أَظْلَمَ عَلَيْهِمْ قَامُوا وَلَوْ شَاءَ اللَّهُ لَذَهَبَ بِسَمْعِهِمْ وَأَبْصَارِهِمْ إِنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ</mark><br>"يَكَاد" يَقْرَب "الْبَرْق يَخْطَف أَبْصَارهمْ" يَأْخُذهَا بِسُرْعَةٍ "كُلَّمَا أَضَاءَ لَهُمْ مَشَوْا فِيهِ" أَيْ فِي ضَوْئِهِ "وَإِذَا أَظْلَم عَلَيْهِمْ قَامُوا" وَقَفُوا تَمْثِيل لِإِزْعَاجِ مَا فِي الْقُرْآن مِنْ الْحُجَج قُلُوبهمْ وَتَصْدِيقهمْ لِمَا سَمِعُوا فِيهِ مِمَّا يُحِبُّونَ وَوُقُوفهمْ عَمَّا يَكْرَهُونَ . "وَلَوْ شَاءَ اللَّه لَذَهَبَ بِسَمْعِهِمْ" بِمَعْنَى أَسْمَاعهمْ "وَأَبْصَارهمْ" الظَّاهِرَة كَمَا ذَهَبَ بِالْبَاطِنَةِ "إنَّ اللَّه عَلَى كُلّ شَيْء" شَاءَهُ "قَدِير" وَمِنْهُ إذْهَاب مَا ذُكِرَ<br><br><mark>{21} يَا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ وَالَّذِينَ مِنْ قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ</mark><br>"يَا أَيّهَا النَّاس" أَيْ أَهْل مَكَّة "اُعْبُدُوا" وَحِّدُوا "رَبّكُمْ الَّذِي خَلَقَكُمْ" أَنْشَأَكُمْ وَلَمْ تَكُونُوا شَيْئًا " وَ " خَلَقَ "الَّذِينَ مِنْ قَبْلكُمْ لَعَلَّكُمْ تَتَّقُونَ" بِعِبَادَتِهِ عِقَابه وَلَعَلَّ : فِي الْأَصْل لِلتَّرَجِّي وَفِي كَلَامه تَعَالَى لِلتَّحْقِيقِ<br><br><mark>{22} الَّذِي جَعَلَ لَكُمُ الْأَرْضَ فِرَاشًا وَالسَّمَاءَ بِنَاءً وَأَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجَ بِهِ مِنَ الثَّمَرَاتِ رِزْقًا لَكُمْ فَلَا تَجْعَلُوا لِلَّهِ أَنْدَادًا وَأَنْتُمْ تَعْلَمُونَ</mark><br>"الَّذِي جَعَلَ" خَلَقَ "لَكُمْ الْأَرْض فِرَاشًا" حَال بِسَاطًا يُفْتَرَش لَا غَايَة فِي الصَّلَابَة أَوْ اللُّيُونَة فَلَا يُمْكِن الِاسْتِقْرَار عَلَيْهَا "وَالسَّمَاء بِنَاء" سَقْفًا "وَأَنْزَلَ مِنْ السَّمَاء مَاء فَأَخْرَجَ بِهِ مِنْ" أَنْوَاع "الثَّمَرَات رِزْقًا لَكُمْ" "فَلَا تَجْعَلُوا لِلَّهِ أَنْدَادًا" شُرَكَاء فِي الْعِبَادَة "وَأَنْتُمْ تَعْلَمُونَ" أَنَّهُ الْخَالِق وَلَا تَخْلُقُونَ وَلَا يَكُون إلَهًا إلَّا مَنْ يَخْلُق<br><br><mark>{23} وَإِنْ كُنْتُمْ فِي رَيْبٍ مِمَّا نَزَّلْنَا عَلَى عَبْدِنَا فَأْتُوا بِسُورَةٍ مِنْ مِثْلِهِ وَادْعُوا شُهَدَاءَكُمْ مِنْ دُونِ اللَّهِ إِنْ كُنْتُمْ صَادِقِينَ</mark><br>"وَإِنْ كُنْتُمْ فِي رَيْب" شَكّ "مِمَّا نَزَّلْنَا عَلَى عَبْدنَا" مُحَمَّد مِنْ الْقُرْآن أَنَّهُ مِنْ عِنْد اللَّه "فَأْتُوا بِسُورَةٍ مِنْ مِثْله" أَيْ الْمُنَزَّل وَمِنْ لِلْبَيَانِ أَيْ هِيَ مِثْله فِي الْبَلَاغَة وَحُسْن النَّظْم وَالْإِخْبَار عَنْ الْغَيْب . وَالسُّورَة قِطْعَة لَهَا أَوَّل وَآخِر أَقَلّهَا ثَلَاث آيَات "وَادْعُوا شُهَدَاءَكُمْ" آلِهَتكُمْ الَّتِي تَعْبُدُونَهَا "مِنْ دُون اللَّه" أَيْ غَيْره لِتُعِينَكُمْ "إنْ كُنْتُمْ صَادِقِينَ" فِي أَنَّ مُحَمَّدًا قَالَهُ مِنْ عِنْد نَفْسه فَافْعَلُوا ذَلِك فَإِنَّكُمْ عَرَبِيُّونَ فُصَحَاء مِثْله وَلَمَّا عَجَزُوا عَنْ ذَلِك قَالَ تَعَالَى<br><br><mark>{24} فَإِنْ لَمْ تَفْعَلُوا وَلَنْ تَفْعَلُوا فَاتَّقُوا النَّارَ الَّتِي وَقُودُهَا النَّاسُ وَالْحِجَارَةُ أُعِدَّتْ لِلْكَافِرِينَ</mark><br>"فَإِنْ لَمْ تَفْعَلُوا" مَا ذُكِرَ لِعَجْزِكُمْ "وَلَنْ تَفْعَلُوا" ذَلِك أَبَدًا لِظُهُورِ إعْجَازه - اعْتِرَاض - "فَاتَّقُوا" بِالْإِيمَانِ بِاَللَّهِ وَأَنَّهُ لَيْسَ مِنْ كَلَام الْبَشَر "النَّار الَّتِي وَقُودهَا النَّاس" الْكُفَّار "وَالْحِجَارَة" كَأَصْنَامِهِمْ مِنْهَا يَعْنِي أَنَّهَا مُفْرِطَة الْحَرَارَة تَتَقَيَّد بِمَا ذُكِرَ لَا كَنَارِ الدُّنْيَا تَتَّقِد بِالْحَطَبِ وَنَحْوه "أُعِدَّتْ" هُيِّئَتْ "لِلْكَافِرِينَ" يُعَذَّبُونَ بِهَا جُمْلَة مُسْتَأْنَفَة أَوْ حَال لَازِمَة<br><br>';}
					else if(counter == 4){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img4.jpg");
                       //txt
					document.getElementById("txt").innerHTML='<mark>{25} وَبَشِّرِ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أَنَّ لَهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ كُلَّمَا رُزِقُوا مِنْهَا مِنْ ثَمَرَةٍ رِزْقًا قَالُوا هَذَا الَّذِي رُزِقْنَا مِنْ قَبْلُ وَأُتُوا بِهِ مُتَشَابِهًا وَلَهُمْ فِيهَا أَزْوَاجٌ مُطَهَّرَةٌ وَهُمْ فِيهَا خَالِدُونَ</mark><br>"وَبَشِّرْ" أَخْبِرْ "الَّذِينَ آمَنُوا" صَدَّقُوا بِاَللَّهِ "وَعَمِلُوا الصَّالِحَات" مِنْ الْفُرُوض وَالنَّوَافِل "أَنَّ" أَيْ بِأَنَّ "لَهُمْ جَنَّات" حَدَائِق ذَات أَشْجَار وَمَسَاكِن "تَجْرِي مِنْ تَحْتهَا" أَيْ تَحْت أَشْجَارهَا وَقُصُورهَا "الْأَنْهَار" أَيْ الْمِيَاه فِيهَا وَالنَّهْر الْمَوْضِع الَّذِي يَجْرِي فِيهِ الْمَاء لِأَنَّ الْمَاء يَنْهَرهُ أَيْ يَحْفِرهُ وَإِسْنَاد الْجَرْي إلَيْهِ مَجَاز "كُلَّمَا رُزِقُوا مِنْهَا" أُطْعِمُوا مِنْ تِلْكَ الْجَنَّات . "مِنْ ثَمَرَة رِزْقًا قَالُوا هَذَا الَّذِي" أَيْ مِثْل مَا "رُزِقْنَا مِنْ قَبْل" أَيْ قَبْله فِي الْجَنَّة لِتَشَابُهِ ثِمَارهَا بِقَرِينَةِ "وَأُتُوا بِهِ" أَيْ جِيئُوا بِالرِّزْقِ "مُتَشَابِهًا" يُشْبِه بَعْضه بَعْضًا لَوْنًا وَيَخْتَلِف طَعْمًا "وَلَهُمْ فِيهَا أَزْوَاج" مِنْ الْحُور وَغَيْرهَا "مُطَهَّرَة" مِنْ الْحَيْض وَكُلّ قَذَر "وَهُمْ فِيهَا خَالِدُونَ" مَاكِثُونَ أَبَدًا لَا يَفْنَوْنَ وَلَا يَخْرُجُونَ . وَنَزَلَ رَدًّا لِقَوْلِ الْيَهُود لَمَّا ضَرَبَ اللَّه الْمَثَل بِالذُّبَابِ فِي قَوْله : ( وَإِنْ يَسْلُبهُمْ الذُّبَاب شَيْئًا وَالْعَنْكَبُوت فِي قَوْله : ( كَمَثَلِ الْعَنْكَبُوت مَا أَرَادَ اللَّه بِذِكْرِ هَذِهِ الْأَشْيَاء ؟ الْخَسِيسَة فَأَنْزَلَ اللَّه<br><br><mark>{26} إِنَّ اللَّهَ لَا يَسْتَحْيِي أَنْ يَضْرِبَ مَثَلًا مَا بَعُوضَةً فَمَا فَوْقَهَا فَأَمَّا الَّذِينَ آمَنُوا فَيَعْلَمُونَ أَنَّهُ الْحَقُّ مِنْ رَبِّهِمْ وَأَمَّا الَّذِينَ كَفَرُوا فَيَقُولُونَ مَاذَا أَرَادَ اللَّهُ بِهَذَا مَثَلًا يُضِلُّ بِهِ كَثِيرًا وَيَهْدِي بِهِ كَثِيرًا وَمَا يُضِلُّ بِهِ إِلَّا الْفَاسِقِينَ</mark><br>"إنَّ اللَّه لَا يَسْتَحْيِ أَنْ يَضْرِب" يَجْعَل "مَثَلًا" مَفْعُول أَوَّل "مَا" نَكِرَة مَوْصُوفَة بِمَا بَعْدهَا مَفْعُول ثَانٍ أَيّ مَثَل كَانَ أَوْ زَائِدَة لِتَأْكِيدِ الْخِسَّة فَمَا بَعْدهَا الْمَفْعُول الثَّانِي "بَعُوضَة" مُفْرَد الْبَعُوض وَهُوَ صِغَار الْبَقّ "فَمَا فَوْقهَا" أَيْ أَكْبَر مِنْهَا أَيْ لَا يَتْرُك بَيَانه لِمَا فِيهِ مِنْ الْحُكْم "فَأَمَّا الَّذِينَ آمَنُوا فَيَعْلَمُونَ أَنَّهُ" أَيْ الْمَثَل "الْحَقّ" الثَّابِت الْوَاقِع مَوْقِعه "مِنْ رَبّهمْ وَأَمَّا الَّذِينَ كَفَرُوا فَيَقُولُونَ مَاذَا أَرَادَ اللَّه بِهَذَا مَثَلًا" تَمْيِيز أَيْ بِهَذَا الْمَثَل وَمَا اسْتِفْهَام إنْكَار مُبْتَدَأ وَذَا بِمَعْنَى الَّذِي بِصِلَتِهِ خَبَره أَيْ : أَيّ فَائِدَة فِيهِ قَالَ تَعَالَى فِي جَوَابهمْ "يُضِلّ بِهِ" أَيْ بِهَذَا الْمَثَل "كَثِيرًا" عَنْ الْحَقّ لِكُفْرِهِمْ بِهِ "وَيَهْدِي بِهِ كَثِيرًا" مِنْ الْمُؤْمِنِينَ لِتَصْدِيقِهِمْ بِهِ "وَمَا يُضِلّ بِهِ إلَّا الْفَاسِقِينَ" الْخَارِجِينَ عَنْ طَاعَته<br><br><mark>{27} الَّذِينَ يَنْقُضُونَ عَهْدَ اللَّهِ مِنْ بَعْدِ مِيثَاقِهِ وَيَقْطَعُونَ مَا أَمَرَ اللَّهُ بِهِ أَنْ يُوصَلَ وَيُفْسِدُونَ فِي الْأَرْضِ أُولَئِكَ هُمُ الْخَاسِرُونَ</mark><br>"الَّذِينَ" نَعْتَ "يَنْقُضُونَ عَهْد اللَّه" مَا عَهِدَهُ إلَيْهِمْ فِي الْكُتُب مِنْ الْإِيمَان بِمُحَمَّدٍ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ "مِنْ بَعْد مِيثَاقه" تَوْكِيده عَلَيْهِمْ "وَيَقْطَعُونَ مَا أَمَرَ اللَّه بِهِ أَنْ يُوصَل" مِنْ الْإِيمَان بِالنَّبِيِّ وَالرَّحِم وَغَيْر ذَلِكَ وَأَنْ بَدَل مِنْ ضَمِير بِهِ "وَيُفْسِدُونَ فِي الْأَرْض" بِالْمَعَاصِي وَالتَّعْوِيق عَنْ الْإِيمَان "أُولَئِكَ" الْمَوْصُوفُونَ بِمَا ذُكِرَ "هُمْ الْخَاسِرُونَ" لِمَصِيرِهِمْ إلَى النَّار الْمُؤَبَّدَة عَلَيْهِمْ<br><br><mark>{28} كَيْفَ تَكْفُرُونَ بِاللَّهِ وَكُنْتُمْ أَمْوَاتًا فَأَحْيَاكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ ثُمَّ إِلَيْهِ تُرْجَعُونَ</mark><br>"كَيْفَ تَكْفُرُونَ" يَا أَهْل مَكَّة "بِاَللَّهِ" وَقَدْ "كُنْتُمْ أَمْوَاتًا" نُطَفًا فِي الْأَصْلَاب "فَأَحْيَاكُمْ" فِي الْأَرْحَام وَالدُّنْيَا بِنَفْخِ الرُّوح فِيكُمْ وَالِاسْتِفْهَام لِلتَّعْجِيبِ مِنْ كُفْرهمْ مَعَ قِيَام الْبُرْهَان أَوْ لِلتَّوْبِيخِ "ثُمَّ يُمِيتكُمْ" عِنْد انْتِهَاء آجَالكُمْ "ثُمَّ يُحْيِيكُمْ" بِالْبَعْثِ "ثُمَّ إلَيْهِ تُرْجَعُونَ" تُرَدُّونَ بَعْد الْبَعْث فَيُجَازِيكُمْ بِأَعْمَالِكُمْ وَقَالَ دَلِيلًا عَلَى الْبَعْث لِمَا أَنْكَرُوهُ<br><br><mark>{29} هُوَ الَّذِي خَلَقَ لَكُمْ مَا فِي الْأَرْضِ جَمِيعًا ثُمَّ اسْتَوَى إِلَى السَّمَاءِ فَسَوَّاهُنَّ سَبْعَ سَمَاوَاتٍ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ</mark><br>"هُوَ الَّذِي خَلَقَ لَكُمْ مَا فِي الْأَرْض" أَيْ الْأَرْض وَمَا فِيهَا "جَمِيعًا" لِتَنْتَفِعُوا بِهِ وَتَعْتَبِرُوا "ثُمَّ اسْتَوَى" بَعْد خَلْق الْأَرْض أَيْ قَصَدَ "إلَى السَّمَاء فَسَوَّاهُنَّ" الضَّمِير يَرْجِع إلَى السَّمَاء لِأَنَّهَا فِي مَعْنَى الْجُمْلَة الْآيِلَة إلَيْهِ : أَيْ صَيَّرَهَا كَمَا فِي آيَة أُخْرَى ( فَقَضَاهُنَّ "سَبْع سَمَاوَات وَهُوَ بِكُلِّ شَيْء عَلِيم" مُجْمَلًا وَمُفَصَّلًا أَفَلَا تَعْتَبِرُونَ أَنَّ الْقَادِر عَلَى خَلْق ذَلِك ابْتِدَاء وَهُوَ أَعْظَم مِنْكُمْ قَادِر عَلَى إعَادَتكُمْ<br><br>';}
                    else if(counter == 5){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img5.jpg");
                       //txt
                    document.getElementById("txt").innerHTML="";}
                    else if(counter == 6){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img6.jpg");
                       //txt
					document.getElementById("txt").innerHTML="";}
                    else if(counter == 7){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img7.jpg");
                       //txt
                    document.getElementById("txt").innerHTML="";}
                    else if(counter == 8){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img8.jpg");
                       //txt
                    document.getElementById("txt").innerHTML="";}
                    else if(counter == 9){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img9.jpg");
                       //txt
					document.getElementById("txt").innerHTML="";}
                    else if(counter == 10){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img10.jpg");
                       //txt
                    document.getElementById("txt").innerHTML="";}
                    else if(counter == 11){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img11.jpg");
                       //txt
					document.getElementById("txt").innerHTML="";}
                    else if(counter == 12){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img12.jpg");
                       //txt
					document.getElementById("txt").innerHTML="";}
                    else if(counter == 13){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img13.jpg");
                       //txt
					document.getElementById("txt").innerHTML="";}
                    else if(counter == 14){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img14.jpg");
                       //txt
					document.getElementById("txt").innerHTML="";}
                    else if(counter == 15){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img15.jpg");
                       //txt
					document.getElementById("txt").innerHTML="";}
                    else if(counter == 16){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img16.jpg");
                       //txt
					document.getElementById("txt").innerHTML="";}
                     else if(counter == 17){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img17.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 18){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img18.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 19){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img19.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 20){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img20.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 21){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img21.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 22){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img22.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 23){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img23.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 24){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img24.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 25){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img25.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 26){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img26.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 27){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img27.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 28){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img28.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 29){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img29.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 30){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img30.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}				    
				    else if(counter == 31){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img31.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 32){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img32.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 33){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img33.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 34){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img34.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 35){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img35.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 36){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img36.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 37){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img37.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 38){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img38.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 39){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img39.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 40){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img40.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 41){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img41.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 42){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img42.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 43){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img43.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 44){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img44.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 45){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img45.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
				    else if(counter == 46){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img46.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
                    else if(counter == 47){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img47.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
					else if(counter == 48){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img48.jpg");
                       //txt
				   document.getElementById("txt").innerHTML="";}
					
					else {counter = 48;}
					
            } 
                
                function previous(){
                    counter--;
                    if(counter == 1){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img1.jpg");
                        //txt
                    document.getElementById("txt").innerHTML='<b style="color: lightblue">البقرة</b><br> <mark>{1} الم</mark><br>الم" اللَّه أَعْلَم بِمُرَادِهِ بِذَلِكَ .<br><br> <mark>{2} ذَلِكَ الْكِتَابُ لَا رَيْبَ فِيهِ هُدًى لِلْمُتَّقِينَ</mark><br>"ذَلِك" أَيْ هَذَا "الْكِتَاب" الَّذِي يَقْرَؤُهُ مُحَمَّد . "لَا رَيْب" لَا شَكَّ "فِيهِ" أَنَّهُ مِنْ عِنْد اللَّه وَجُمْلَة النَّفْي خَبَر مُبْتَدَؤُهُ ذَلِك وَالْإِشَارَة بِهِ لِلتَّعْظِيمِ "هُدًى" خَبَر ثَانٍ أَيْ هَادٍ "لِلْمُتَّقِينَ" الصَّائِرِينَ إلَى التَّقْوَى بِامْتِثَالِ الْأَوَامِر وَاجْتِنَاب النَّوَاهِي لِاتِّقَائِهِمْ بِذَلِكَ النَّار <br><br> <mark>{3} الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلَاةَ وَمِمَّا رَزَقْنَاهُمْ يُنْفِقُونَ</mark><br>"الَّذِينَ يُؤْمِنُونَ" يُصَدِّقُونَ "بِالْغَيْبِ" بِمَا غَابَ عَنْهُمْ مِنْ الْبَعْث وَالْجَنَّة وَالنَّار "وَيُقِيمُونَ الصَّلَاة" أَيْ يَأْتُونَ بِهَا بِحُقُوقِهَا "وَمِمَّا رَزَقْنَاهُمْ" أَعْطَيْنَاهُمْ "يُنْفِقُونَ" فِي طَاعَة اللَّه <br><br> <mark>{4} وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنْزِلَ إِلَيْكَ وَمَا أُنْزِلَ مِنْ قَبْلِكَ وَبِالْآخِرَةِ هُمْ يُوقِنُونَ</mark><br>"وَاَلَّذِينَ يُؤْمِنُونَ بِمَا أُنْزِلَ إلَيْك" أَيْ الْقُرْآن "وَمَا أُنْزِلَ مِنْ قَبْلك" أَيْ التَّوْرَاة وَالْإِنْجِيل وَغَيْرهمَا "وَبِالْآخِرَةِ هُمْ يُوقِنُونَ" يَعْلَمُونَ <br><br> <mark>{5} أُولَئِكَ عَلَى هُدًى مِنْ رَبِّهِمْ وَأُولَئِكَ هُمُ الْمُفْلِحُونَ</mark><br>"أُولَئِكَ" الْمَوْصُوفُونَ بِمَا ذُكِرَ "عَلَى هُدًى مِنْ رَبّهمْ وَأُولَئِكَ هُمْ الْمُفْلِحُونَ" الْفَائِزُونَ بِالْجَنَّةِ النَّاجُونَ مِنْ النَّار<br><br>';
                    }
                    else if(counter == 2){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img2.jpg");
                        //txt
				   document.getElementById("txt").innerHTML='<mark>{6} إِنَّ الَّذِينَ كَفَرُوا سَوَاءٌ عَلَيْهِمْ أَأَنْذَرْتَهُمْ أَمْ لَمْ تُنْذِرْهُمْ لَا يُؤْمِنُونَ</mark><br>"إنّ الَّذِينَ كَفَرُوا" كَأَبِي جَهْل وَأَبِي لَهَب وَنَحْوهمَا "سَوَاء عَلَيْهِمْ أَأَنْذَرْتهمْ" بِتَحْقِيقِ الْهَمْزَتَيْنِ وَإِبْدَال الثَّانِيَة أَلِفًا وَتَسْهِيلهَا وَإِدْخَال أَلِف بَيْن الْمُسَهَّلَة وَالْأُخْرَى وَتَرْكه "أَمْ لَمْ تُنْذِرهُمْ لَا يُؤْمِنُونَ" لِعِلْمِ اللَّه مِنْهُمْ ذَلِك فَلَا تَطْمَع فِي إيمَانهمْ وَالْإِنْذَار إعْلَام مَعَ تَخْوِيف .<br><br><mark>{7} خَتَمَ اللَّهُ عَلَى قُلُوبِهِمْ وَعَلَى سَمْعِهِمْ وَعَلَى أَبْصَارِهِمْ غِشَاوَةٌ وَلَهُمْ عَذَابٌ عَظِيمٌ</mark><br>"خَتَمَ اللَّه عَلَى قُلُوبهمْ" طَبَعَ عَلَيْهَا وَاسْتَوْثَقَ فَلَا يَدْخُلهَا خَيْر "وَعَلَى سَمْعهمْ" أَيْ مَوَاضِعه فَلَا يَنْتَفِعُونَ بِمَا يَسْمَعُونَهُ مِنْ الْحَقّ "وَعَلَى أَبْصَارهمْ غِشَاوَة" غِطَاء فَلَا يُبْصِرُونَ الْحَقّ "وَلَهُمْ عَذَاب عَظِيم" قَوِيّ دَائِم<br><br><mark>{8} وَمِنَ النَّاسِ مَنْ يَقُولُ آمَنَّا بِاللَّهِ وَبِالْيَوْمِ الْآخِرِ وَمَا هُمْ بِمُؤْمِنِينَ</mark><br>"وَمِنْ النَّاس مَنْ يَقُول آمَنَّا بِاَللَّهِ وَبِالْيَوْمِ الْآخِر" وَنَزَلَ فِي الْمُنَافِقِينَ أَيْ يَوْم الْقِيَامَة لِأَنَّهُ آخِر الْأَيَّام "وَمَا هُمْ بِمُؤْمِنِينَ" رُوعِيَ فِيهِ مَعْنَى مِنْ وَفِي ضَمِير يَقُول لَفْظهَا<br><br><mark>{9} يُخَادِعُونَ اللَّهَ وَالَّذِينَ آمَنُوا وَمَا يَخْدَعُونَ إِلَّا أَنْفُسَهُمْ وَمَا يَشْعُرُونَ</mark><br>"يُخَادِعُونَ اللَّه وَاَلَّذِينَ آمَنُوا" بِإِظْهَارِ خِلَاف مَا أَبْطَنُوهُ مِنْ الْكُفْر لِيَدْفَعُوا عَنْهُمْ أَحْكَامه الدُّنْيَوِيَّة "وَمَا يَخْدَعُونَ إلَّا أَنَفْسهمْ" لِأَنَّ وَبَال خِدَاعهمْ رَاجِع إلَيْهِمْ فَيُفْتَضَحُونَ فِي الدُّنْيَا بِإِطْلَاعِ اللَّه نَبِيّه عَلَى مَا أَبْطَنُوهُ وَيُعَاقَبُونَ فِي الْآخِرَة "وَمَا يَشْعُرُونَ" يَعْلَمُونَ أَنَّ خِدَاعهمْ لِأَنْفُسِهِمْ وَالْمُخَادَعَة هُنَا مِنْ وَاحِد كَعَاقَبْت اللِّصّ وَذِكْر اللَّه فِيهَا تَحْسِين وَفِي قِرَاءَة وَمَا يَخْدَعُونَ<br><br><mark>{10} فِي قُلُوبِهِمْ مَرَضٌ فَزَادَهُمُ اللَّهُ مَرَضًا وَلَهُمْ عَذَابٌ أَلِيمٌ بِمَا كَانُوا يَكْذِبُونَ</mark><br>"فِي قُلُوبهمْ مَرَض" شَكّ وَنِفَاق فَهُوَ يُمْرِض قُلُوبهمْ أَيْ يُضْعِفهَا "فَزَادَهُمْ اللَّه مَرَضًا" بِمَا أَنْزَلَهُ مِنْ الْقُرْآن لِكُفْرِهِمْ بِهِ "وَلَهُمْ عَذَاب أَلِيم" مُؤْلِم "بِمَا كَانُوا يُكَذِّبُونَ" بِالتَّشْدِيدِ أَيْ : نَبِيّ اللَّه وَبِالتَّخْفِيفِ أَيْ قَوْلهمْ آمَنَّا<br><br><mark>{11} وَإِذَا قِيلَ لَهُمْ لَا تُفْسِدُوا فِي الْأَرْضِ قَالُوا إِنَّمَا نَحْنُ مُصْلِحُونَ</mark><br>"وَإِذَا قِيلَ لَهُمْ" أَيْ لِهَؤُلَاءِ "لَا تُفْسِدُوا فِي الْأَرْض" بِالْكُفْرِ وَالتَّعْوِيق عَنْ الْإِيمَان "قَالُوا إنَّمَا نَحْنُ مُصْلِحُونَ" وَلَيْسَ مَا نَحْنُ فِيهِ بِفَسَادٍ قَالَ اللَّه تَعَالَى رَدًّا عَلَيْهِمْ :<br><br><mark>{12} أَلَا إِنَّهُمْ هُمُ الْمُفْسِدُونَ وَلَكِنْ لَا يَشْعُرُونَ</mark><br>"أَلَا" لِلتَّنْبِيهِ "إنَّهُمْ هُمْ الْمُفْسِدُونَ وَلَكِنْ لَا يَشْعُرُونَ" بِذَلِكَ .<br><br><mark>{13} وَإِذَا قِيلَ لَهُمْ آمِنُوا كَمَا آمَنَ النَّاسُ قَالُوا أَنُؤْمِنُ كَمَا آمَنَ السُّفَهَاءُ أَلَا إِنَّهُمْ هُمُ السُّفَهَاءُ وَلَكِنْ لَا يَعْلَمُونَ</mark><br>"وَإِذَا قِيلَ لَهُمْ آمِنُوا كَمَا آمَنَ النَّاس" أَصْحَاب النَّبِيّ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ "قَالُوا أَنُؤْمِنُ كَمَا آمَنَ السُّفَهَاء" الْجُهَّال أَيْ لَا نَفْعَل كَفِعْلِهِمْ قَالَ تَعَالَى رَدًّا عَلَيْهِمْ : "أَلَا إنَّهُمْ هُمْ السُّفَهَاء وَلَكِنْ لَا يَعْلَمُونَ" ذَلِك<br><br><mark>{14} وَإِذَا لَقُوا الَّذِينَ آمَنُوا قَالُوا آمَنَّا وَإِذَا خَلَوْا إِلَى شَيَاطِينِهِمْ قَالُوا إِنَّا مَعَكُمْ إِنَّمَا نَحْنُ مُسْتَهْزِئُونَ</mark><br>"وَإِذَا لَقُوا" أَصْله لَقْيُوا حُذِفَتْ الضَّمَّة لِلِاسْتِثْقَالِ ثُمَّ الْيَاء لِالْتِقَائِهَا سَاكِنَة مَعَ الْوَاو "الَّذِينَ آمَنُوا قَالُوا آمَنَّا وَإِذَا خَلَوْا" مِنْهُمْ وَرَجَعُوا "إلَى شَيَاطِينهمْ" رُؤَسَائِهِمْ "قَالُوا إنَّا مَعَكُمْ" فِي الدِّين "إنَّمَا نَحْنُ مُسْتَهْزِئُونَ" بِهِمْ بِإِظْهَارِ الْإِيمَان<br><br><mark>{15} اللَّهُ يَسْتَهْزِئُ بِهِمْ وَيَمُدُّهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ</mark><br>"اللَّه يَسْتَهْزِئ بِهِمْ" يُجَازِيهِمْ بِاسْتِهْزَائِهِمْ "وَيَمُدّهُمْ" يُمْهِلهُمْ "فِي طُغْيَانهمْ" بِتَجَاوُزِهِمْ الْحَدّ فِي الْكُفْر "يَعْمَهُونَ" يَتَرَدَّدُونَ تَحَيُّرًا حَال<br><br><mark>{16} أُولَئِكَ الَّذِينَ اشْتَرَوُا الضَّلَالَةَ بِالْهُدَى فَمَا رَبِحَتْ تِجَارَتُهُمْ وَمَا كَانُوا مُهْتَدِينَ</mark><br>"أُولَئِكَ الَّذِينَ اشْتَرَوْا الضَّلَالَة بِالْهُدَى" أَيْ اسْتَبْدَلُوهَا بِهِ "فَمَا رَبِحَتْ تِجَارَتهمْ" أَيْ مَا رَبِحُوا فِيهَا بَلْ خَسِرُوا لِمَصِيرِهِمْ إلَى النَّار الْمُؤَبَّدَة عَلَيْهِمْ "وَمَا كَانُوا مُهْتَدِينَ" فِيمَا فَعَلُوا<br><br>';                 }
                    else if(counter == 3){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img3.jpg");
                       //txt
					document.getElementById("txt").innerHTML='<mark>{17} مَثَلُهُمْ كَمَثَلِ الَّذِي اسْتَوْقَدَ نَارًا فَلَمَّا أَضَاءَتْ مَا حَوْلَهُ ذَهَبَ اللَّهُ بِنُورِهِمْ وَتَرَكَهُمْ فِي ظُلُمَاتٍ لَا يُبْصِرُونَ</mark><br>"مَثَلهمْ" صِفَتهمْ فِي نِفَاقهمْ "كَمَثَلِ الَّذِي اسْتَوْقَدَ" أَوْقَدَ "نَارًا" فِي ظُلْمَة "فَلَمَّا أَضَاءَتْ" أَنَارَتْ "مَا حَوْله" فَأَبْصَرَ وَاسْتَدْفَأَ وَأَمِنَ مِمَّنْ يَخَافهُ "ذَهَبَ اللَّه بِنُورِهِمْ" أَطْفَأَهُ وَجُمِعَ الضَّمِير مُرَاعَاة لِمَعْنَى الَّذِي "وَتَرَكَهُمْ فِي ظُلُمَات لَا يُبْصِرُونَ" مَا حَوْلهمْ مُتَحَيِّرِينَ عَنْ الطَّرِيق خَائِفِينَ فَكَذَلِكَ هَؤُلَاءِ أَمِنُوا بِإِظْهَارِ كَلِمَة الْإِيمَان فَإِذَا مَاتُوا جَاءَهُمْ الْخَوْف وَالْعَذَاب<br><br><mark>{18} صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لَا يَرْجِعُونَ</mark><br>هُمْ "صُمّ" عَنْ الْحَقّ فَلَا يَسْمَعُونَهُ سَمَاع قَبُول "بُكْم" خُرْس عَنْ الْخَيْر فَلَا يَقُولُونَهُ "عُمْي" عَنْ طَرِيق الْهُدَى فَلَا يَرَوْنَهُ "فَهُمْ لَا يَرْجِعُونَ" عَنْ الضَّلَالَة<br><br><mark>{19} أَوْ كَصَيِّبٍ مِنَ السَّمَاءِ فِيهِ ظُلُمَاتٌ وَرَعْدٌ وَبَرْقٌ يَجْعَلُونَ أَصَابِعَهُمْ فِي آذَانِهِمْ مِنَ الصَّوَاعِقِ حَذَرَ الْمَوْتِ وَاللَّهُ مُحِيطٌ بِالْكَافِرِينَ</mark><br>"أَوْ" مَثَلهمْ "كَصَيِّبٍ" أَيْ كَأَصْحَابِ مَطَر وَأَصْله صَيْوِب مِنْ صَابَ يَصُوب أَيْ يَنْزِل "مِنْ السَّمَاء" السَّحَاب "فِيهِ" أَيْ السَّحَاب "ظُلُمَات" مُتَكَاثِفَة "وَرَعْد" هُوَ الْمَلَك الْمُوَكَّل بِهِ وَقِيلَ صَوْته "وَبَرْق" لَمَعَان صَوْته الَّذِي يَزْجُرهُ بِهِ "يَجْعَلُونَ" أَيْ أَصْحَاب الصَّيِّب "أَصَابِعهمْ" أَيْ أَنَامِلهَا "فِي آذَانهمْ مِنْ" أَجْل "الصَّوَاعِق" شِدَّة صَوْت الرَّعْد لِئَلَّا يَسْمَعُوهَا "حَذَر" خَوْف "الْمَوْت" مِنْ سَمَاعهَا . كَذَلِكَ هَؤُلَاءِ : إذَا نَزَلَ الْقُرْآن وَفِيهِ ذِكْر الْكُفْر الْمُشَبَّه بِالظُّلُمَاتِ وَالْوَعِيد عَلَيْهِ الْمُشَبَّه بِالرَّعْدِ وَالْحُجَج الْبَيِّنَة الْمُشَبَّهَة بِالْبَرْقِ يَسُدُّونَ آذَانهمْ لِئَلَّا يَسْمَعُوهُ فَيَمِيلُوا إلَى الْإِيمَان وَتَرْك دِينهمْ وَهُوَ عِنْدهمْ مَوْت "وَاَللَّه مُحِيط بِالْكَافِرِينَ" عِلْمًا وَقُدْرَة فَلَا يَفُوتُونَهُ<br><br><mark>{20} يَكَادُ الْبَرْقُ يَخْطَفُ أَبْصَارَهُمْ كُلَّمَا أَضَاءَ لَهُمْ مَشَوْا فِيهِ وَإِذَا أَظْلَمَ عَلَيْهِمْ قَامُوا وَلَوْ شَاءَ اللَّهُ لَذَهَبَ بِسَمْعِهِمْ وَأَبْصَارِهِمْ إِنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ</mark><br>"يَكَاد" يَقْرَب "الْبَرْق يَخْطَف أَبْصَارهمْ" يَأْخُذهَا بِسُرْعَةٍ "كُلَّمَا أَضَاءَ لَهُمْ مَشَوْا فِيهِ" أَيْ فِي ضَوْئِهِ "وَإِذَا أَظْلَم عَلَيْهِمْ قَامُوا" وَقَفُوا تَمْثِيل لِإِزْعَاجِ مَا فِي الْقُرْآن مِنْ الْحُجَج قُلُوبهمْ وَتَصْدِيقهمْ لِمَا سَمِعُوا فِيهِ مِمَّا يُحِبُّونَ وَوُقُوفهمْ عَمَّا يَكْرَهُونَ . "وَلَوْ شَاءَ اللَّه لَذَهَبَ بِسَمْعِهِمْ" بِمَعْنَى أَسْمَاعهمْ "وَأَبْصَارهمْ" الظَّاهِرَة كَمَا ذَهَبَ بِالْبَاطِنَةِ "إنَّ اللَّه عَلَى كُلّ شَيْء" شَاءَهُ "قَدِير" وَمِنْهُ إذْهَاب مَا ذُكِرَ<br><br><mark>{21} يَا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ وَالَّذِينَ مِنْ قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ</mark><br>"يَا أَيّهَا النَّاس" أَيْ أَهْل مَكَّة "اُعْبُدُوا" وَحِّدُوا "رَبّكُمْ الَّذِي خَلَقَكُمْ" أَنْشَأَكُمْ وَلَمْ تَكُونُوا شَيْئًا " وَ " خَلَقَ "الَّذِينَ مِنْ قَبْلكُمْ لَعَلَّكُمْ تَتَّقُونَ" بِعِبَادَتِهِ عِقَابه وَلَعَلَّ : فِي الْأَصْل لِلتَّرَجِّي وَفِي كَلَامه تَعَالَى لِلتَّحْقِيقِ<br><br><mark>{22} الَّذِي جَعَلَ لَكُمُ الْأَرْضَ فِرَاشًا وَالسَّمَاءَ بِنَاءً وَأَنْزَلَ مِنَ السَّمَاءِ مَاءً فَأَخْرَجَ بِهِ مِنَ الثَّمَرَاتِ رِزْقًا لَكُمْ فَلَا تَجْعَلُوا لِلَّهِ أَنْدَادًا وَأَنْتُمْ تَعْلَمُونَ</mark><br>"الَّذِي جَعَلَ" خَلَقَ "لَكُمْ الْأَرْض فِرَاشًا" حَال بِسَاطًا يُفْتَرَش لَا غَايَة فِي الصَّلَابَة أَوْ اللُّيُونَة فَلَا يُمْكِن الِاسْتِقْرَار عَلَيْهَا "وَالسَّمَاء بِنَاء" سَقْفًا "وَأَنْزَلَ مِنْ السَّمَاء مَاء فَأَخْرَجَ بِهِ مِنْ" أَنْوَاع "الثَّمَرَات رِزْقًا لَكُمْ" "فَلَا تَجْعَلُوا لِلَّهِ أَنْدَادًا" شُرَكَاء فِي الْعِبَادَة "وَأَنْتُمْ تَعْلَمُونَ" أَنَّهُ الْخَالِق وَلَا تَخْلُقُونَ وَلَا يَكُون إلَهًا إلَّا مَنْ يَخْلُق<br><br><mark>{23} وَإِنْ كُنْتُمْ فِي رَيْبٍ مِمَّا نَزَّلْنَا عَلَى عَبْدِنَا فَأْتُوا بِسُورَةٍ مِنْ مِثْلِهِ وَادْعُوا شُهَدَاءَكُمْ مِنْ دُونِ اللَّهِ إِنْ كُنْتُمْ صَادِقِينَ</mark><br>"وَإِنْ كُنْتُمْ فِي رَيْب" شَكّ "مِمَّا نَزَّلْنَا عَلَى عَبْدنَا" مُحَمَّد مِنْ الْقُرْآن أَنَّهُ مِنْ عِنْد اللَّه "فَأْتُوا بِسُورَةٍ مِنْ مِثْله" أَيْ الْمُنَزَّل وَمِنْ لِلْبَيَانِ أَيْ هِيَ مِثْله فِي الْبَلَاغَة وَحُسْن النَّظْم وَالْإِخْبَار عَنْ الْغَيْب . وَالسُّورَة قِطْعَة لَهَا أَوَّل وَآخِر أَقَلّهَا ثَلَاث آيَات "وَادْعُوا شُهَدَاءَكُمْ" آلِهَتكُمْ الَّتِي تَعْبُدُونَهَا "مِنْ دُون اللَّه" أَيْ غَيْره لِتُعِينَكُمْ "إنْ كُنْتُمْ صَادِقِينَ" فِي أَنَّ مُحَمَّدًا قَالَهُ مِنْ عِنْد نَفْسه فَافْعَلُوا ذَلِك فَإِنَّكُمْ عَرَبِيُّونَ فُصَحَاء مِثْله وَلَمَّا عَجَزُوا عَنْ ذَلِك قَالَ تَعَالَى<br><br><mark>{24} فَإِنْ لَمْ تَفْعَلُوا وَلَنْ تَفْعَلُوا فَاتَّقُوا النَّارَ الَّتِي وَقُودُهَا النَّاسُ وَالْحِجَارَةُ أُعِدَّتْ لِلْكَافِرِينَ</mark><br>"فَإِنْ لَمْ تَفْعَلُوا" مَا ذُكِرَ لِعَجْزِكُمْ "وَلَنْ تَفْعَلُوا" ذَلِك أَبَدًا لِظُهُورِ إعْجَازه - اعْتِرَاض - "فَاتَّقُوا" بِالْإِيمَانِ بِاَللَّهِ وَأَنَّهُ لَيْسَ مِنْ كَلَام الْبَشَر "النَّار الَّتِي وَقُودهَا النَّاس" الْكُفَّار "وَالْحِجَارَة" كَأَصْنَامِهِمْ مِنْهَا يَعْنِي أَنَّهَا مُفْرِطَة الْحَرَارَة تَتَقَيَّد بِمَا ذُكِرَ لَا كَنَارِ الدُّنْيَا تَتَّقِد بِالْحَطَبِ وَنَحْوه "أُعِدَّتْ" هُيِّئَتْ "لِلْكَافِرِينَ" يُعَذَّبُونَ بِهَا جُمْلَة مُسْتَأْنَفَة أَوْ حَال لَازِمَة<br><br>';
					   }
                    else if(counter == 4){
                        //img
                    var img=document.getElementById("img");
                    img.setAttribute("src","../pics/002/img4.jpg");
                       //txt
					document.getElementById("txt").innerHTML='<mark>{25} وَبَشِّرِ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أَنَّ لَهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ كُلَّمَا رُزِقُوا مِنْهَا مِنْ ثَمَرَةٍ رِزْقًا قَالُوا هَذَا الَّذِي رُزِقْنَا مِنْ قَبْلُ وَأُتُوا بِهِ مُتَشَابِهًا وَلَهُمْ فِيهَا أَزْوَاجٌ مُطَهَّرَةٌ وَهُمْ فِيهَا خَالِدُونَ</mark><br>"وَبَشِّرْ" أَخْبِرْ "الَّذِينَ آمَنُوا" صَدَّقُوا بِاَللَّهِ "وَعَمِلُوا الصَّالِحَات" مِنْ الْفُرُوض وَالنَّوَافِل "أَنَّ" أَيْ بِأَنَّ "لَهُمْ جَنَّات" حَدَائِق ذَات أَشْجَار وَمَسَاكِن "تَجْرِي مِنْ تَحْتهَا" أَيْ تَحْت أَشْجَارهَا وَقُصُورهَا "الْأَنْهَار" أَيْ الْمِيَاه فِيهَا وَالنَّهْر الْمَوْضِع الَّذِي يَجْرِي فِيهِ الْمَاء لِأَنَّ الْمَاء يَنْهَرهُ أَيْ يَحْفِرهُ وَإِسْنَاد الْجَرْي إلَيْهِ مَجَاز "كُلَّمَا رُزِقُوا مِنْهَا" أُطْعِمُوا مِنْ تِلْكَ الْجَنَّات . "مِنْ ثَمَرَة رِزْقًا قَالُوا هَذَا الَّذِي" أَيْ مِثْل مَا "رُزِقْنَا مِنْ قَبْل" أَيْ قَبْله فِي الْجَنَّة لِتَشَابُهِ ثِمَارهَا بِقَرِينَةِ "وَأُتُوا بِهِ" أَيْ جِيئُوا بِالرِّزْقِ "مُتَشَابِهًا" يُشْبِه بَعْضه بَعْضًا لَوْنًا وَيَخْتَلِف طَعْمًا "وَلَهُمْ فِيهَا أَزْوَاج" مِنْ الْحُور وَغَيْرهَا "مُطَهَّرَة" مِنْ الْحَيْض وَكُلّ قَذَر "وَهُمْ فِيهَا خَالِدُونَ" مَاكِثُونَ أَبَدًا لَا يَفْنَوْنَ وَلَا يَخْرُجُونَ . وَنَزَلَ رَدًّا لِقَوْلِ الْيَهُود لَمَّا ضَرَبَ اللَّه الْمَثَل بِالذُّبَابِ فِي قَوْله : ( وَإِنْ يَسْلُبهُمْ الذُّبَاب شَيْئًا وَالْعَنْكَبُوت فِي قَوْله : ( كَمَثَلِ الْعَنْكَبُوت مَا أَرَادَ اللَّه بِذِكْرِ هَذِهِ الْأَشْيَاء ؟ الْخَسِيسَة فَأَنْزَلَ اللَّه<br><br><mark>{26} إِنَّ اللَّهَ لَا يَسْتَحْيِي أَنْ يَضْرِبَ مَثَلًا مَا بَعُوضَةً فَمَا فَوْقَهَا فَأَمَّا الَّذِينَ آمَنُوا فَيَعْلَمُونَ أَنَّهُ الْحَقُّ مِنْ رَبِّهِمْ وَأَمَّا الَّذِينَ كَفَرُوا فَيَقُولُونَ مَاذَا أَرَادَ اللَّهُ بِهَذَا مَثَلًا يُضِلُّ بِهِ كَثِيرًا وَيَهْدِي بِهِ كَثِيرًا وَمَا يُضِلُّ بِهِ إِلَّا الْفَاسِقِينَ</mark><br>"إنَّ اللَّه لَا يَسْتَحْيِ أَنْ يَضْرِب" يَجْعَل "مَثَلًا" مَفْعُول أَوَّل "مَا" نَكِرَة مَوْصُوفَة بِمَا بَعْدهَا مَفْعُول ثَانٍ أَيّ مَثَل كَانَ أَوْ زَائِدَة لِتَأْكِيدِ الْخِسَّة فَمَا بَعْدهَا الْمَفْعُول الثَّانِي "بَعُوضَة" مُفْرَد الْبَعُوض وَهُوَ صِغَار الْبَقّ "فَمَا فَوْقهَا" أَيْ أَكْبَر مِنْهَا أَيْ لَا يَتْرُك بَيَانه لِمَا فِيهِ مِنْ الْحُكْم "فَأَمَّا الَّذِينَ آمَنُوا فَيَعْلَمُونَ أَنَّهُ" أَيْ الْمَثَل "الْحَقّ" الثَّابِت الْوَاقِع مَوْقِعه "مِنْ رَبّهمْ وَأَمَّا الَّذِينَ كَفَرُوا فَيَقُولُونَ مَاذَا أَرَادَ اللَّه بِهَذَا مَثَلًا" تَمْيِيز أَيْ بِهَذَا الْمَثَل وَمَا اسْتِفْهَام إنْكَار مُبْتَدَأ وَذَا بِمَعْنَى الَّذِي بِصِلَتِهِ خَبَره أَيْ : أَيّ فَائِدَة فِيهِ قَالَ تَعَالَى فِي جَوَابهمْ "يُضِلّ بِهِ" أَيْ بِهَذَا الْمَثَل "كَثِيرًا" عَنْ الْحَقّ لِكُفْرِهِمْ بِهِ "وَيَهْدِي بِهِ كَثِيرًا" مِنْ الْمُؤْمِنِينَ لِتَصْدِيقِهِمْ بِهِ "وَمَا يُضِلّ بِهِ إلَّا الْفَاسِقِينَ" الْخَارِجِينَ عَنْ طَاعَته<br><br><mark>{27} الَّذِينَ يَنْقُضُونَ عَهْدَ اللَّهِ مِنْ بَعْدِ مِيثَاقِهِ وَيَقْطَعُونَ مَا أَمَرَ اللَّهُ بِهِ أَنْ يُوصَلَ وَيُفْسِدُونَ فِي الْأَرْضِ أُولَئِكَ هُمُ الْخَاسِرُونَ</mark><br>"الَّذِينَ" نَعْتَ "يَنْقُضُونَ عَهْد اللَّه" مَا عَهِدَهُ إلَيْهِمْ فِي الْكُتُب مِنْ الْإِيمَان بِمُحَمَّدٍ صَلَّى اللَّه عَلَيْهِ وَسَلَّمَ "مِنْ بَعْد مِيثَاقه" تَوْكِيده عَلَيْهِمْ "وَيَقْطَعُونَ مَا أَمَرَ اللَّه بِهِ أَنْ يُوصَل" مِنْ الْإِيمَان بِالنَّبِيِّ وَالرَّحِم وَغَيْر ذَلِكَ وَأَنْ بَدَل مِنْ ضَمِير بِهِ "وَيُفْسِدُونَ فِي الْأَرْض" بِالْمَعَاصِي وَالتَّعْوِيق عَنْ الْإِيمَان "أُولَئِكَ" الْمَوْصُوفُونَ بِمَا ذُكِرَ "هُمْ الْخَاسِرُونَ" لِمَصِيرِهِمْ إلَى النَّار الْمُؤَبَّدَة عَلَيْهِمْ<br><br><mark>{28} كَيْفَ تَكْفُرُونَ بِاللَّهِ وَكُنْتُمْ أَمْوَاتًا فَأَحْيَاكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ ثُمَّ إِلَيْهِ تُرْجَعُونَ</mark><br>"كَيْفَ تَكْفُرُونَ" يَا أَهْل مَكَّة "بِاَللَّهِ" وَقَدْ "كُنْتُمْ أَمْوَاتًا" نُطَفًا فِي الْأَصْلَاب "فَأَحْيَاكُمْ" فِي الْأَرْحَام وَالدُّنْيَا بِنَفْخِ الرُّوح فِيكُمْ وَالِاسْتِفْهَام لِلتَّعْجِيبِ مِنْ كُفْرهمْ مَعَ قِيَام الْبُرْهَان أَوْ لِلتَّوْبِيخِ "ثُمَّ يُمِيتكُمْ" عِنْد انْتِهَاء آجَالكُمْ "ثُمَّ يُحْيِيكُمْ" بِالْبَعْثِ "ثُمَّ إلَيْهِ تُرْجَعُونَ" تُرَدُّونَ بَعْد الْبَعْث فَيُجَازِيكُمْ بِأَعْمَالِكُمْ وَقَالَ دَلِيلًا عَلَى الْبَعْث لِمَا أَنْكَرُوهُ<br><br><mark>{29} هُوَ الَّذِي خَلَقَ لَكُمْ مَا فِي الْأَرْضِ جَمِيعًا ثُمَّ اسْتَوَى إِلَى السَّمَاءِ فَسَوَّاهُنَّ سَبْعَ سَمَاوَاتٍ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ</mark><br>"هُوَ الَّذِي خَلَقَ لَكُمْ مَا فِي الْأَرْض" أَيْ الْأَرْض وَمَا فِيهَا "جَمِيعًا" لِتَنْتَفِعُوا بِهِ وَتَعْتَبِرُوا "ثُمَّ اسْتَوَى" بَعْد خَلْق الْأَرْض أَيْ قَصَدَ "إلَى السَّمَاء فَسَوَّاهُنَّ" الضَّمِير يَرْجِع إلَى السَّمَاء لِأَنَّهَا فِي مَعْنَى الْجُمْلَة الْآيِلَة إلَيْهِ : أَيْ صَيَّرَهَا كَمَا فِي آيَة أُخْرَى ( فَقَضَاهُنَّ "سَبْع سَمَاوَات وَهُوَ بِكُلِّ شَيْء عَلِيم" مُجْمَلًا وَمُفَصَّلًا أَفَلَا تَعْتَبِرُونَ أَنَّ الْقَادِر عَلَى خَلْق ذَلِك ابْتِدَاء وَهُوَ أَعْظَم مِنْكُمْ قَادِر عَلَى إعَادَتكُمْ<br><br>';}
                   
                    else {counter = 1;}
            } 
